Repository: Tishman/testyoungst
Catalog: YoungSt/Core/Sources/Common/Resources/Files/*.lproj/Errors.strings
Languages: ru

# errUnknown
source: Unknown error
ru: Неизвестная ошибка

# errConnectionIssue
source: Could not establish internet connection. Check your network config
ru: Не могу подключиться к серверу. Проверьте интернет соединение

# errInternal
source: Internal error
ru: Внутренняя ошибка сервиса

# errVerificationNotFoundUser
source: User not found
ru: Пользователь не найден

# errVerificationInvalidRegID
source: Invalid registration identifier
ru: Неверный идентификатор регистрации

# errVerificationNotConfirmedRegID
source: Registration not confirmed. Please provide confirmation code
ru: Регистрация не подтверждена. Пожалуйста, введите код подтверждения

# errVerificationRegIdNotExists
source: Registration id not exists. Please register new user
ru: Регистрация не найдена. Пожалуйста, зарегестрируйтесь

# errInvalidCredentials
source: Invalid credentials
ru: Неверный логин или пароль

# errUserAlreadyExists
source: User already exists
ru: Пользователь уже существует

# errNicknameAlreadyTaken
source: Nickname already taken. Please choose anoser
ru: Имя пользователя занято. Пожалуйста, выберите другое

# errIncorrectResetPasswordCode
source: Incorrect reset code
ru: Неверный код сброса пароля

# errInvalidFormat
source: Invalid input format
ru: Неверный формат данных

# errInvalidEmail
source: Invalid email
ru: Неверный email

# errInvalidLogin
source: Invalid login
ru: Неверный login

# errInvalidPassword
source: Invalid password
ru: Неверный пароль

# errIncorrectConfirmationCode
source: Incorrect confirmation code. Please check again
ru: Неверный код подтверждения. Пожалуйста, проверьте ещё раз

# errLanguageNotSupported
source: Language not supported yed
ru: Язык пока что не поддерживается

# errIncorrectRequest
source: Incorrect request data
ru: Неверный запрос

# errGroupNotFound
source: Group not found. Maybe it already deleted?
ru: Группа не найдена. Может, она уже удалена?

# errWordNotFound
source: Word not found. Maybe it already deleted?
ru: Слово не найдено. Может, оно уже удалено?

# errNoAccess
source: No acces for requested operation
ru: Нет доступа к запрашиваемой операции

# errMetadataNotFound
source: Information metadata not found
ru: Метаданные не найдены

# errLocalesNotSet
source: Locales metadata not found
ru: Метаданные о языке не найдены

# errSessionNotProvided
source: Session not provided. Are you logged out?
ru: Сессия не найдена. Может быть, вы не залогинились?

# errUserIdNotProvided
source: User identifier not provided. Are you logged out?
ru: Идентификатор пользователя не найден. Может быть, вы не залогинились?

# errNotFoundInviteAndRelation
source: Not found information. Maybe relation not exists?
ru: Информация не найдена. Вы отправляли запрос подтверждения?

# errInviteNotFound
source: Invite not found. Maybe it already rejected or accepted?
ru: Запрос не найден. Может, его уже приняли или отклонили?

# errTeacherEmpty
source: Not found teacher
ru: Учитель не найден

# errInvalidFirstName
source: First name is icorrect
ru: Неверное имя

# errInvalidLastName
source: Last name is incorrect
ru: Неверная фамилия

# errInvalidNickname
source: Nickname is incorrect
ru: Неверный никнейм

# errNicknameAlreadyUsed
source: Nickname already taken. Please choose anoser
ru: Никнейм уже занят. Пожалуйста, попробуйте другой

# errProfileNotFound
source: Profile info not found. Maybe you are not registered?
ru: Информация о профиле не найдена. Может, вы не зарегестрировались?

# errInviteExpired
source: Invite expired
ru: Время действия приглашения истекло

# errAlreadyHaveTeacher
source: You already have teacher
ru: Уже есть учитель

# errIncorrectInvitePassword
source: Invorrect invite link
ru: Неверная ссылка на приглашение
